# ========================< 清空软件残留信息 >==============================

# 退出之前仿真
quit -sim

# 清空信息
.main clear

# =========================< 建立工程并仿真 >===============================

# 建立新的工程库
vlib work

# 映射逻辑库到物理目录
vmap work work

# 编译仿真文件
vlog ./tb/*.v

# 编译设计文件
vlog ./rtl/*.v

# 无优化simulation                                      *** 请修改文件名 ***
vsim -novopt work.tb

# ============================< 加载波形 >=================================

# 添加波形 以unsigned格式显示               
add wave -radix unsigned ./tb/u_inst/*

# 清空信息
.main clear

# 跑完
run -all